content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Combinator Parsing
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: combinator-parsing
:END:

We have seen a few different kinds of parsers to this point.  They all work by constructing
state machines to handle the parsing.  A new class of parsers has started to become popular
lately.  Combinator parsers use functions to represent parsers, and they can be composed together
to make more sophisticated parsers.

We will show how to build one of these from the ground up, and make use of monads to give us
a natural syntax.

***  Videos

- [[/videos/combinator-parsing][Combinator Parsing]]
- [[https://mediaspace.illinois.edu/media/t/1_ir3m0ngw][Activity Walkthrough (Spring 2022)]]
# - [[/videos/combinator-parsing-activity][Combinator Parsing Activity]]  This is a walkthrough of an older activity, linked below.

*** Further Reading
- [[/handouts/combinator-parsing-pogil.pdf][Old Combinator Parsing Activity]]
- [[http://www.cs.nott.ac.uk/~pszgmh/monparsing.pdf][Monadic Parser Combinators (Graham Hutton)]]
  This paper is a tutorial about monads and parser combinators. It uses a language called Gopher, a precursor to Haskell.

